app/controllers/events_controller.rb

SELECT * FROM `events` WHERE (starttime >= '2010-07-12 00:00:00' and endtime <= '2010-07-17 00:00:00')
---
  def get_events

    @events = Event.find(:all, :conditions => ["starttime >= '#{Time.at(params['start'].to_i).to_formatted_s(:db)}' and endtime <= '#{Time.at(params['end'].to_i).to_formatted_s(:db)}'"] )

SELECT * FROM `events` WHERE (`events`.student_id = 1) LIMIT 1
UPDATE `events` SET `updated_at` = '2010-07-12 04:22:00', `endtime` = '2010-07-14 08:45:00', `starttime` = '2010-07-14 08:30:00' WHERE `id` = 22
---
  def move
    @event = Event.find_by_id params[:id]
    if(current_student)
      if(@event.student_id == current_student.id)
    if @event
      @event.starttime = (params[:minute_delta].to_i).minutes.from_now((params[:day_delta].to_i).days.from_now(@event.starttime))
      @event.endtime = (params[:minute_delta].to_i).minutes.from_now((params[:day_delta].to_i).days.from_now(@event.endtime))
      @event.all_day = params[:all_day]
      @event.save

SELECT * FROM `events` WHERE (`events`.student_id = 1) LIMIT 1
DELETE FROM `events` WHERE `id` = 35
---
  def destroy
    @event = Event.find_by_id(params[:id])
    if params[:delete_all] == 'true'
      @event.event_series.destroy