app/controllers/students_controller.rb

 def show
   @student = Student.find(params[:id])
---
SELECT * FROM `students` WHERE (`students`.`id` = '1') LIMIT 1